Enums/ВидыДоговоровКонтрагентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Enum>
		<Properties>
			<Name>ВидыДоговоровКонтрагентов</Name>
			<Comment>(Общ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>СПоставщиком</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СПокупателем</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СКомитентом</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СКомиссионером</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прочее</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/КонтрактыИсполнителей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Catalog>
		<Properties>
			<Name>КонтрактыИсполнителей</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Контрагенты</xr:Item>
			</Owners>
			<BasedOn>
				<xr:Item>Catalog.ГосударственныеКонтракты</xr:Item>
				<xr:Item>Catalog.КонтрактыСЗаказчиками</xr:Item>
			</BasedOn>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостоянияКонтрактов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Номер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтрактСУчастникомГОЗ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БанковскийСчетКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГосударственныйКонтракт</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГосударственныеКонтракты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипПлатежаФЗ275</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыПлатежейФЗ275</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПлатежиПо275ФЗ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособОпределенияПоставщика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СпособыОпределенияПоставщиков</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаКонтракта</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РаспределениеОплатПоБанковскимСчетам</Name>
					<Type>
						<v8:Type>cfg:EnumRef.РаспределениеЗаявокПоБанковскимСчетам</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроцентОплатыЗаСчетСобственныхСредств</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕстьВУтвержденномПеречнеИностранныхИсполнителейГОЗ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаДобавленияПоследнегоДопСоглашения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПодтверждающиеДокументы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидДокумента</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыДокументов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Этап</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЭтапыКонтрактов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Файл</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХранилищеДополнительнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номер</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>25</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Дата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ГосударственныйКонтракт</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ГосударственныеКонтракты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>НомераКонтрактов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КонтрактСЗаказчиком</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КонтрактыСЗаказчиками</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Процент</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonModules/ОбщегоНазначения275КлиентСервер/Ext/Module.bsl
Процедура ПроверитьДоговор(Контракт, Договор, ВидДоговора, ВидКонтракта, Отказ) Экспорт
	
	Если Не ЗначениеЗаполнено(Договор) Тогда
		Возврат;
	КонецЕсли;
	// Проверка единственности связи контракт-договор
	
	Запрос = Новый Запрос();
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Контракты.Ссылка,
	|	Контракты.Представление
	|ИЗ
	|	Справочник.КонтрактыСЗаказчиками КАК Контракты
	|ГДЕ
	|	Контракты.Ссылка <> &Ссылка
	|	И Контракты.Договор = &Договор
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Контракты.Ссылка,
	|	Контракты.Представление
	|ИЗ
	|	Справочник.КонтрактыИсполнителей КАК Контракты
	|ГДЕ
	|	Контракты.Ссылка <> &Ссылка
	|	И Контракты.Договор = &Договор";
	Запрос.УстановитьПараметр("Ссылка", Контракт);
	Запрос.УстановитьПараметр("Договор", Договор);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		ТекстОшибки = СтрШаблон("Выбранный договор уже используется в контракте ""%1""", Выборка.Представление);
		ОбщегоНазначения.СообщитьОбОшибке(ТекстОшибки, Отказ);
	КонецЕсли;

	// Поверка корректности реквизитов
	Реквизиты = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Договор, "ВидДоговора,ВалютаВзаиморасчетов,ПометкаУдаления,РасчетыВУсловныхЕдиницах");
	
	Если Реквизиты.ВидДоговора <> ВидДоговора Тогда
		ТекстОшибки = СтрШаблон("В контракте с %1 можно использовать только договор вида %2", ВидКонтракта, Строка(ВидДоговора));
		ОбщегоНазначения.СообщитьОбОшибке(ТекстОшибки, Отказ);
	КонецЕсли;

	Если Реквизиты.ВалютаВзаиморасчетов <> глЗначениеПеременной("ВалютаРегламентированногоУчета") И 
		Не Реквизиты.РасчетыВУсловныхединицах Тогда
		ТекстОшибки = "Можно использовать только договоры в валюте регламентированного учета или с расчетами в условных единицах";
		ОбщегоНазначения.СообщитьОбОшибке(ТекстОшибки, Отказ);
	КонецЕсли;
	
	Если Реквизиты.ПометкаУдаления Тогда
		ТекстОшибки = "Нельзя использовать договоры, помеченные на удаление";
		ОбщегоНазначения.СообщитьОбОшибке(ТекстОшибки, Отказ);
	КонецЕсли;

КонецПроцедуры

Функция НайтиПодчиненныйКонтракт(Договор) Экспорт
	
	Результат = Неопределено;
	
	Если ЗначениеЗаполнено(Договор) Тогда
		ГдеИскать = "";
		Если Договор.ВидДоговора = ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.СПокупателем") Тогда
			ГдеИскать = "КонтрактыСЗаказчиками";
		ИначеЕсли Договор.ВидДоговора = ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.СПоставщиком") Тогда
			ГдеИскать = "КонтрактыИсполнителей";
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ГдеИскать) Тогда
			Запрос = Новый Запрос();
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	Контракты.Ссылка,
			|	Контракты.Представление
			|ИЗ
			|	Справочник."+ГдеИскать+" КАК Контракты
			|ГДЕ
			|	Контракты.Договор = &Договор
			|	И Не Контракты.ПометкаУдаления
			|";      
			Запрос.УстановитьПараметр("Договор", Договор);
			Выборка = Запрос.Выполнить().Выбрать();
			
			Если Выборка.Следующий() Тогда
				Результат = Выборка.Ссылка;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;

	Возврат Результат;
	
КонецФункции

Функция ТекстСообщенияОНеобходимостиНастройкиСистемы(ВидОперации = Неопределено) Экспорт
	
	Если ВидОперации = Неопределено Тогда
		ТекстСообщения = НСтр("ru = 'Для работы с платежами по государственным контрактам необходимо в форме ""Настройка параметров учета""
		|на закладке ""Государственные контракты"" включить использование данной возможности.'");
	Иначе
		ТекстСообщения = НСтр("ru='Операция не может быть выполнена'");
	КонецЕсли;
	
	Возврат ТекстСообщения;
	
КонецФункции

Процедура ПроверитьИспользованиеПодсистемы(Отказ) Экспорт
	Если Не глЗначениеПеременной("ВестиУчетПлатежейПоГосконтрактам") Тогда
		ТекстСообщения = ОбщегоНазначения275КлиентСервер.ТекстСообщенияОНеобходимостиНастройкиСистемы();
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		Отказ = Истина;
	КонецЕсли;
КонецПроцедуры

Процедура ПоказатьСтруктуруПодчиненности(ПараметрКоманды) Экспорт
	
	// Здесь должен быть код из модуля общей команды "СтруктураПодчиненности"
	#Если Клиент Тогда
	Если ЗначениеЗаполнено(ПараметрКоманды) Тогда

		ОткрытьФорму("ОбщаяФорма.СтруктураПодчиненности",Новый Структура("ОбъектОтбора", ПараметрКоманды));

	КонецЕсли;
	#КонецЕсли		

КонецПроцедуры

Функция ПлатежПоФЗ275(Документ) Экспорт
	Результат = Ложь;
	Если ТипЗнч(Документ) = Тип("ДокументСсылка.ЗаявкаНаРасходованиеСредств") Тогда
		Результат = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Документ, "ПлатежПоФЗ275");
	ИначеЕсли ТипЗнч(Документ) = Тип("ДокументОбъект.ЗаявкаНаРасходованиеСредств") Тогда
		Результат = Документ.ПлатежПоФЗ275;
	ИначеЕсли ТипЗнч(Документ) = Тип("ДокументСсылка.ПлатежноеПоручениеИсходящее") 
		ИЛИ ТипЗнч(Документ) = Тип("ДокументОбъект.ПлатежноеПоручениеИсходящее") Тогда
		Если Документ.РасшифровкаПлатежа.Количество() > 0 Тогда
			Заявка = Документ.РасшифровкаПлатежа[0].ДокументПланированияПлатежа;
			Если ЗначениеЗаполнено(Заявка) Тогда
				Результат = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Заявка, "ПлатежПоФЗ275");
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	Возврат Результат;
КонецФункции

Функция ТипПлатежаФЗ275(Документ) Экспорт
	Результат = Справочники.ТипыПлатежейФЗ275.ПустаяСсылка();
	Если ТипЗнч(Документ) = Тип("ДокументСсылка.ЗаявкаНаРасходованиеСредств") Тогда
		Результат = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Документ, "ТипПлатежаФЗ275");
	ИначеЕсли ТипЗнч(Документ) = Тип("ДокументОбъект.ЗаявкаНаРасходованиеСредств") Тогда
		Результат = Документ.ТипПлатежаФЗ275;
	ИначеЕсли ТипЗнч(Документ) = Тип("ДокументСсылка.ПлатежноеПоручениеИсходящее") 
		ИЛИ ТипЗнч(Документ) = Тип("ДокументОбъект.ПлатежноеПоручениеИсходящее") Тогда
		Если Документ.РасшифровкаПлатежа.Количество() > 0 Тогда
			Заявка = Документ.РасшифровкаПлатежа[0].ДокументПланированияПлатежа;
			Если ЗначениеЗаполнено(Заявка) Тогда
				Результат = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Заявка, "ТипПлатежаФЗ275");
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	Возврат Результат;
КонецФункции

Функция ЗаявкаНаРасходованиеДенежныхСредств(Ссылка) Экспорт
	Результат = Документы.ЗаявкаНаРасходованиеСредств.ПустаяСсылка();
	Если ТипЗнч(Ссылка) = Тип("ДокументСсылка.ПлатежноеПоручениеИсходящее") Тогда
		Если Ссылка.РасшифровкаПлатежа.Количество() > 0 Тогда
			Результат = Ссылка.РасшифровкаПлатежа[0].ДокументПланированияПлатежа;
		КонецЕсли;
	КонецЕсли;
	Возврат Результат;
КонецФункции
